
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
      
        <link rel="prev" href="../../C_C%2B%2B/C_C%2B%2B/">
      
      
        <link rel="next" href="../../Linux/Linux%E5%9F%BA%E7%A1%80/Linux%E5%9F%BA%E7%A1%80/">
      
      
      <link rel="icon" href="../../assets/images/favicon.png">
      <meta name="generator" content="mkdocs-1.5.2, mkdocs-material-9.2.8">
    
    
      
        <title>C_C++代码调试 - Blog</title>
      
    
    
      <link rel="stylesheet" href="../../assets/stylesheets/main.046329b4.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
    <script>__md_scope=new URL("../..",location),__md_hash=e=>[...e].reduce((e,_)=>(e<<5)-e+_.charCodeAt(0),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    <body dir="ltr">
  
    
    

#0  0x00007ffff7e392a5 in __cxa_begin_catch () from /lib/x86_64-linux-gnu/libstdc++.so.6
#1  0x0000555555556c64 in test_try_catch (number=10) at chapter_3.3.cpp:202
#2  0x0000555555556cd3 in main (argc=1, argv=0x7fffffffe178) at chapter_3.3.cpp:214
(gdb) f 1
#1  0x0000555555556c64 in test_try_catch (number=10) at chapter_3.3.cpp:202
202             catch(...)
(gdb) i locals
local_data = 10
name = 0x5555555591f4 &quot;test_try_catch&quot;
(gdb) i args
number = 10
</code></pre>
<p>可以看到，程序在第二处捕获点中断，而且类型是catch。然后我们使用帧切换命令切换到1号帧查看局部变量和函数入参。
命令catch还有一个对应的命令<code>tcatch</code>，意思是临时捕获，即只捕获一次，命中后会自动删除该捕获点(与临时断点类似)。</p>
<h5 id="3143">3.14.3 搜索源代码</h5>
<p>3.9节介绍了查看源代码功能，但是仅仅使用查看源代码的功能还远远不够，尤其是在程序的代码量比较大的情况下。有时候需要去查找、搜索自己关注的代码，然后进行断点设置等操作。代码搜索主要有以下几个命令：
<code>search 正则表达式</code>
<code>forward-search 正则表达式</code></p>
<p>这两个命令是相同的，都是在当前文件中从前往后搜索满足正则表达式的代码，进行逐行匹配，如果该行有满足条件的代码，则显示行号。如果要继续往后搜索，可以继续输入search命令，也可以简单的按下Enter键，继续进行搜索。如果搜索结束或者没有找到匹配的代码，则提示没有找到，如下所示：</p>
<pre><code class="language-c++">(gdb) search member
17      int member_id = 0;
(gdb)
18      void add_member()
(gdb)
36              new_node-&gt;ID = member_id++;
(gdb)
252                             add_member();
(gdb)
Expression not found
</code></pre>
<p>如上所示，从前往后搜索代码<code>member</code>，首先在第17行找到匹配的代码，按Enter键继续搜索。然后在第18行也找到了匹配代码，一直搜索到没有匹配的代码为止。在显示搜索结果时，会按照源文件中的格式进行输出，比如空格、Tab等控制符也会显示出来，这样就比较容易发现源代码的使用方式和调用位置。因为同样是调用一个函数，可能是在主函数中调用，也可能是在循环内部调用，通过Tab或者空格键可以对此大致区分。</p>
<p><code>reverse-search 正则表达式</code>
反向搜索代码的规则相同。如果搜索到匹配的代码，则显示行号和对应的代码，否则会提示没有找到匹配代码，如下所示：</p>
<pre><code class="language-c++">(gdb) reverse-search NODE*
244             node_head = (struct NODE*)malloc(sizeof(NODE));
(gdb)
135             TEST_NODE *node = new TEST_NODE;
(gdb)
124     struct TEST_NODE
(gdb)
22              NODE* prev_node = node_head-&gt;prev;
(gdb)
20              struct NODE *new_node = (NODE*)malloc(sizeof(NODE));
(gdb)
16      struct NODE *node_head = NULL;
(gdb)
14              NODE *next;
(gdb)
13              NODE* prev;
(gdb)
8       struct NODE
(gdb)
Expression not found
</code></pre>
<p>使用反向搜索命令搜索包含<code>NODE</code>关键字的代码，先在244行找到。继续按Enter键，然后在135行找到对应代码，以此类推。最后一个匹配的代码行是第8行，再往前搜索，则找不到匹配的代码行，所以提示"Expression not found"。</p>
<h5 id="3144">3.14.4 查看变量类型</h5>
<p>在调试时，尤其是在调试不是自己编写的代码时，我们可能对代码和变量的类型并不熟悉。如果该变量是一个类，其中包含那些成员函数和成员变量等也不是很清晰。查看源代码比较麻烦，需要搜索查找。这时可以使用命令ptype来查看变量或者结构体以及类等详细信息。语法如下：
<code>ptype 可选参数 变量或者类型</code>
其中，可选参数用来控制显示信息，变量或者类型可以是任意的变量，也可以是定义的数据类型，比如类、结构体、枚举等。
其中可选参数如下所示：
- /r
表示以原始数据的方式显示，不会替代一些typedef定义。/m 查看类时，不会显示类的方法，只显示成员变量。
- /M
与/m相反，显示类的方法(默认选项)。
- /t
不打印类中的typedef数据
- /o
打印结构体字段的偏移量和大小。</p>
<p>下面对ptype进行详细的演示，先使用命令查看结构体：
<code>ptype node_head</code></p>
<pre><code class="language-c++">(gdb) ptype node_head
type = struct NODE {
    int ID;
    char Name[40];
    int age;
    NODE *prev;
    NODE *next;
} *
</code></pre>
<p>其中node_head是代码中的一个结构体指针，使用ptype命令只会显示成员名称和类型，不会显示字段的偏移量和大小。添加<code>/o</code>参数后，可以打印偏移量和大小信息，如下所示：</p>
<pre><code class="language-c++">(gdb) ptype /o node_head
type = struct NODE {
/*      0      |       4 */    int ID;
/*      4      |      40 */    char Name[40];
/*     44      |       4 */    int age;
/*     48      |       8 */    NODE *prev;
/*     56      |       8 */    NODE *next;

                               /* total size (bytes):   64 */
                             } *
</code></pre>
<p>可以清楚的看到结构体NODE中每一个成员的大小、所占的字节数，以及整个结构体所占的空间大小。代码中定义了一个结构体TEST_NODE，可以直接查看TEST_NODE的信息，如下所示：</p>
<pre><code class="language-c++">(gdb) ptype TEST_NODE
type = struct TEST_NODE {
    char gender[3];
    int ID;
    char name[7];
}
(gdb) ptype /o  TEST_NODE
/* offset      |    size */  type = struct TEST_NODE {
/*      0      |       3 */    char gender[3];
/* XXX  1-byte hole      */
/*      4      |       4 */    int ID;
/*      8      |       7 */    char name[7];
/* XXX  1-byte padding   */

                               /* total size (bytes):   16 */
                             }
</code></pre>
<p>结构体TEST_NODE的成员gender占用3字节，偏移量为0，后面的一个字节显示<code>1-byte hole</code>，表示该字节为空，用于字节对齐，所以成员ID的偏移量为4。最后一个成员name占用7字节，为了能够使整个结构体以4字节方式对齐和填充，所以后面一个字节显示<code>1-byte padding</code>。
再来看类的信息。代码中有test_1和test_2两个类，其中test_2是从test_1继承而来的，如下所示：</p>
<pre><code class="language-c++">(gdb) ptype test_1
type = class test_1 {
  private:
    int x;
    int y;

  public:
    test_1(void);
    ~test_1();
    virtual void test_fun(void);
}
(gdb) ptype test_2
type = class test_2 : public test_1 {
  public:
    test_2(void);
    ~test_2();
    virtual void test_fun2(void);
    virtual void test_fun(void);
}
</code></pre>
<p>尽管test_2是从test_1继承而来的，但是查看test_2时，并不会把test_1的变量和函数一起显示，而是只显示test_2拥有的成员信息。也可以添加参数<code>/o</code>来查看类的成员变量的偏移量以及大小等。查看类test_1的成员变量信息如下所示：</p>
<pre><code class="language-c++">(gdb) ptype /o  test_1
/* offset      |    size */  type = class test_1 {
                             private:
/*      8      |       4 */    int x;
/*     12      |       4 */    int y;

                               /* total size (bytes):   16 */
                             }
</code></pre>
<p>为什么test_1只有两个整型成员变量，整个test_1的大小却是16呢？因为test_1有一个虚函数，所以会有一个虚函数表，而我们的程序是64位的，每个指针占用8字节。因此test_1的空间大小就是两个int型的大小加上一个8字节的虚函数表指针，一共16字节。
还有一个简单的命令<code>whatis</code>用来查看变量或者表达式的类型，只是打印的信息比较简单，如下所示：</p>
<pre><code class="language-c++">(gdb) whatis test_1
type = test_1
(gdb) whatis call_fun_test_1
type = int (int, const char *)
(gdb) ptype call_fun_test_1
type = int (int, const char *)
</code></pre>
<h5 id="3145">3.14.5 跳转执行</h5>
<p>在调试过程中，很多时候我们希望某些代码能够被反复执行，因为我们希望能够多次查看问题，以便更加仔细的观察问题。有时候又希望直接跳过某些代码，比如环境的问题、不能满足某些条件、部分代码没有意义或者会执行失败等。
这就是跳转执行，即不按照代码的流程逐行执行，而是按照我们期望的方式执行。命令语法如下：
<code>jump 位置</code>
命令中的位置可以是代码行或者某个函数的地址。假设我们的代码在函数<code>add_member</code>中执行，如下所示：</p>
<pre><code class="language-c++">void add_member()
{
    struct NODE *new_node = (NODE *)malloc(sizeof(NODE));
    new_node-&gt;next = NULL;
    NODE *prev_node = node_head-&gt;prev;
